In [4]:
# Import libraries needed for this lab
import pandas as pd
import numpy as np

import inspect

### DateTime Wrangling

In [51]:
df = pd.read_csv('data/chopped.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 569 entries, 0 to 568
Data columns (total 20 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   season            569 non-null    int64
 1   season_episode    569 non-null    int64
 2   series_episode    569 non-null    int64
 3   episode_name      569 non-null    object
 4   episode_notes     456 non-null    object
 5   air_date          569 non-null    object
 6   judge1            568 non-null    object
 7   judge2            568 non-null    object
 8   judge3            568 non-null    object
 9   appetizer         569 non-null    object
 10  entree            569 non-null    object
 11  dessert           568 non-null    object
 12  contestant1       568 non-null    object
 13  contestant1_info  556 non-null    object
 14  contestant2       569 non-null    object
 15  contestant2_info  555 non-null    object
 16  contestant3       569 non-null    object
 17  contestant3_info  556 non-null    object
 18  contestant4       569 non-null    object
 19  contestant4_info  555 non-null    object
dtypes: int64(3), object(17)
memory usage: 89.0+ KB

In [53]:
chopped = pd.read_csv('data/chopped.csv', parse_dates=["air_date"])
chopped.head()

,season,season_episode,series_episode,episode_name,episode_notes,air_date,judge1,judge2,judge3,appetizer,entree,dessert,contestant1,contestant1_info,contestant2,contestant2_info,contestant3,contestant3_info,contestant4,contestant4_info
0,1,1,1,"""Octopus, Duck, Animal Crackers""",This is the first episode with only three offi...,2009-01-13,Marc Murphy,Alex Guarnaschelli,Aarón Sánchez,"baby octopus, bok choy, oyster sauce, smoked ...","duck breast, green onions, ginger, honey","prunes, animal crackers, cream cheese",Summer Kriegshauser,Private Chef and Nutrition Coach New York NY,Perry Pollaci,Private Chef and Sous chef Bar Blanc New Yo...,Katie Rosenhouse,Pastry Chef Olana Restaurant New York NY,Sandy Davis,Catering Chef Showstoppers Catering at Union...
1,1,2,2,"""Tofu, Blueberries, Oysters""",This is the first of a few episodes with five ...,2009-01-20,Aarón Sánchez,Alex Guarnaschelli,Marc Murphy,"firm tofu, tomato paste, prosciutto","daikon, pork loin, Napa cabbage, Thai chiles,...","phyllo dough, gorgonzola cheese, pineapple ri...",Raymond Jackson,Private Caterer and Culinary Instructor West...,Klaus Kronsteiner,Chef de cuisine Liberty National Golf Course...,Christopher Jackson,Executive Chef and Owner Ted and Honey Broo...,Pippa Calland,Owner and Chef Chef for Hire LLC Newville PA
2,1,3,3,"""Avocado, Tahini, Bran Flakes""",NaN,2009-01-27,Aarón Sánchez,Alex Guarnaschelli,Marc Murphy,"lump crab meat, dried shiitake mushrooms, pin...","ground beef, cannellini beans, tahini paste, ...","brioche, cantaloupe, pecans, avocados",Margaritte Malfy,Executive Chef and Co-owner La Palapa New Y...,Rachelle Rodwell,Chef de cuisine SoHo Grand Hotel New York NY,Chris Burke,Private Chef New York NY,Andre Marrero,Chef tournant L’Atelier de Joël Robuchon Ne...
3,1,4,4,"""Banana, Collard Greens, Grits""","In the appetizer round, Chef Chuboda refused t...",2009-02-03,Scott Conant,Amanda Freitag,Geoffrey Zakarian,"ground beef, wonton wrappers, cream of mushro...","scallops, collard greens, anchovies, sour cream","maple syrup, black plums, almond butter, waln...",Sean Chudoba,Executive Chef Ayza Wine Bar New York NY,Kyle Shadix,Chef Registered Dietician and Culinary Consu...,Luis Gonzales,Executive Chef Knickerbocker Bar & Grill Ne...,Einat Admony,Chef and Owner Taïm New York NY
4,1,5,5,"""Yucca, Watermelon, Tortillas""",NaN,2009-02-10,Geoffrey Zakarian,Alex Guarnaschelli,Marc Murphy,"watermelon, canned sardines, pepper jack chee...","beef shoulder, yucca, raisins, ancho chiles, ...","flour tortillas, prosecco, Canadian bacon, ro...",John Keller,Personal Chef New York NY,Andrea Bergquist,Executive Chef New York NY,Ed Witt,Executive Chef / Wine Director Bloomingdale ...,Josh Emett,Chef de cuisine Gordon Ramsay at The London ...

How can we look at the difference of dates?

In [47]:
chopped["air_date"].max() -chopped["air_date"].min()

Timedelta('4221 days 00:00:00')

In [54]:
(chopped["air_date"].max() - chopped["air_date"].min()).days

4221

How can I check the differences between dates in the whole data frame?

In [55]:
chopped["air_date"]

0     2009-01-13
1     2009-01-20
2     2009-01-27
3     2009-02-03
4     2009-02-10
         ...
564   2020-06-23
565   2020-06-30
566   2020-07-07
567   2020-07-21
568   2020-07-28
Name: air_date, Length: 569, dtype: datetime64[ns]

In [10]:
chopped["air_date"].diff()
# Notice the first NaT

0         NaT
1      7 days
2      7 days
3      7 days
4      7 days
        ...
564    7 days
565    7 days
566    7 days
567   14 days
568    7 days
Name: air_date, Length: 569, dtype: timedelta64[ns]

In [56]:
chopped["air_date"]

0     2009-01-13
1     2009-01-20
2     2009-01-27
3     2009-02-03
4     2009-02-10
         ...
564   2020-06-23
565   2020-06-30
566   2020-07-07
567   2020-07-21
568   2020-07-28
Name: air_date, Length: 569, dtype: datetime64[ns]

In [60]:
chopped['air_date'].dt.month_name()

0       January
1       January
2       January
3      February
4      February
         ...
564        June
565        June
566        July
567        July
568        July
Name: air_date, Length: 569, dtype: object

### Cleaning the dirty df

In [ ]:
#clean.copy()

In [61]:
dirty = pd.read_csv('data/dirty_gapminder.csv')
dirty.head(2)

   year        pop  lifeExp   gdpPercap continent      country
0  1952  8425333.0   28.801  779.445314      Asia  Afghanistan
1  1957  9240934.0   30.332  820.853030      Asia  Afghanistan

In [62]:
clean = pd.read_csv('data/clean_gapminder.csv')
clean.head(2)

       country  year        pop continent  lifeExp   gdpPercap
0  Afghanistan  1952  8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957  9240934.0      Asia   30.332  820.853030

Motivation: Make dirty look the same way as clean

In [65]:
(~clean.eq(dirty)).any(axis=1)

0       False
1       False
2       False
3       False
4       False
        ...
1699    False
1700    False
1701    False
1702    False
1703    False
Length: 1704, dtype: bool

In [67]:
dirty[dirty['country']=='Canada'].head(1)

     year         pop  lifeExp    gdpPercap continent country
240  1952  14785584.0    68.75  11367.16112       NaN  Canada

In [26]:
dirty[(~clean.eq(dirty)).any(axis=1)].shape

(28, 6)

In [70]:
# This shows what you have
dirty[(~clean.eq(dirty)).any(axis=1)].head(1)

     year         pop  lifeExp    gdpPercap continent country
240  1952  14785584.0    68.75  11367.16112       NaN  Canada

In [71]:
# This is the goal
clean[(~clean.eq(dirty)).any(axis=1)].head(1)

    country  year         pop continent  lifeExp    gdpPercap
240  Canada  1952  14785584.0  Americas    68.75  11367.16112

In [72]:
dirty[dirty.isnull().any(axis=1)]

     year         pop  lifeExp    gdpPercap continent country
240  1952  14785584.0   68.750  11367.16112       NaN  Canada
241  1957  17010154.0   69.960  12489.95006       NaN  Canada
242  1962  18985849.0   71.300  13462.48555       NaN  Canada
243  1967  20819767.0   72.130  16076.58803       NaN  Canada
244  1972  22284500.0   72.880  18970.57086       NaN  Canada
245  1977  23796400.0   74.210  22090.88306       NaN  Canada
246  1982  25201900.0   75.760  22898.79214       NaN  Canada
247  1987  26549700.0   76.860  26626.51503       NaN  Canada
248  1992  28523502.0   77.950  26342.88426       NaN  Canada
249  1997  30305843.0   78.610  28954.92589       NaN  Canada
250  2002  31902268.0   79.770  33328.96507       NaN  Canada
251  2007  33390141.0   80.653  36319.23501       NaN  Canada

In [80]:
def cleaned_gapminder(dirty_df):
    
    # Let's fill the na's with `.fillna()`
    dirty_df = dirty_df.fillna(value="Americas")
    dirty_df.columns = ['country', 'year', 'pop', 'continent', 'lifeExp', 'gdpPercap']

    return dirty_df

In [82]:
cleaned_data = cleaned_gapminder(dirty)

In [83]:
clean[(~cleaned_data.eq(clean)).any(axis=1)].head(2)

       country  year        pop continent  lifeExp   gdpPercap
0  Afghanistan  1952  8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957  9240934.0      Asia   30.332  820.853030

In [79]:
clean.columns

Index(['country', 'year', 'pop', 'continent', 'lifeExp', 'gdpPercap'], dtype='object')

In [84]:
cleaned_data[(~cleaned_data.eq(clean)).any(axis=1)].head(2)

   country       year     pop   continent lifeExp    gdpPercap
0     1952  8425333.0  28.801  779.445314    Asia  Afghanistan
1     1957  9240934.0  30.332  820.853030    Asia  Afghanistan